InformationRegisters/ШаблоныЭВФОтчетовСтатистики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ШаблоныЭВФОтчетовСтатистики</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОКУД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПериодичности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодФормы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шифр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяФайлаШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ШаблоныЭВФОтчетовСтатистики/Ext/ManagerModule.bsl
Процедура ПриПолученииНовогоШаблонаФСГС(Знач ПараметрыШаблона) Экспорт
	Если Метаданные.РегистрыСведений.Найти("ШаблоныЭВФОтчетовСтатистики") = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ДобавитьШаблоны(ПараметрыШаблона);
КонецПроцедуры

Процедура ДобавитьШаблоны(ПараметрыШаблона) Экспорт 
	Попытка
		КоличествоНезагруженныхШаблонов = 0;
		ФормаСписка = РегистрыСведений.ШаблоныЭВФОтчетовСтатистики.ПолучитьФорму("ФормаСписка");
		КороткиеИменаФайлов = Новый Массив;
		КороткиеИменаФайлов.Добавить(ПараметрыШаблона.ИсходноеИмяФайла);
		ШаблоныЭВФ = Новый Массив;
		ШаблонЭВФ = Новый Структура;
		ШаблонЭВФ.Вставить("ИмяФайлаШаблона", НРег(ПараметрыШаблона.ИсходноеИмяФайла));
		ОбъектФайл = Новый Файл(ПараметрыШаблона.ПолноеИмяФайлаДанных);
		ШаблонЭВФ.Вставить("Размер", ОбъектФайл.Размер());
		ШаблонЭВФ.Вставить("Шаблон", Новый ДвоичныеДанные(ПараметрыШаблона.ПолноеИмяФайлаДанных));
		ШаблоныЭВФ.Добавить(ШаблонЭВФ);
		ФормаСписка.ЗагрузитьШаблоны(ШаблоныЭВФ, КоличествоНезагруженныхШаблонов);
		Если КоличествоНезагруженныхШаблонов > 0 Тогда 
			ЗаписьЖурналаРегистрации("ПриПолученииНовогоШаблонаФСГС", УровеньЖурналаРегистрации.Предупреждение, , , "Не удалось загрузить шаблон");
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("ПриПолученииНовогоШаблонаФСГС", УровеньЖурналаРегистрации.Предупреждение, , , "Не удалось загрузить шаблон");
	КонецПопытки;
КонецПроцедуры
